/**
*   ************************************************************************************
*								上海芯圣电子股份有限公司
*								    www.holychip.cn
*	************************************************************************************
*	@Examle Version		V1.0.5.0
*	@Demo 	Version		V1.0.4.0
*	@Date				2019.12.27
*	************************************************************************************
*									 模块性能介绍
*	1、由于内部低频RC振荡器频率随工艺角有偏差，因此可通过定时器T5进行捕获测量系统实际的
*	   内部低频RC频率，然后根据实际的频率值计算WDT溢出时间。
*	2、RC44K最小值31KHz，最大值58KHz。
*	************************************************************************************
*									 应用注意事项
*	1、禁止WDT复位时（WDTRST=0），并不会关闭WDT功能，WDT依旧可以计数并在计数溢出时置中
*	   断标志位。
*	2、若要关闭WDT功能，只需WDTCCR寄存器写入0x00，就可以关闭WDT功能即禁止WDT，但内部低
*	   频RC（44KHz）不会关闭，若要启动WDT，只需WDTCCR写入非0数据WDT就会启动。
*	3、在使用WDT进行掉电模式唤醒时请注意，清狗动作和进入掉电指令之间间隔大于等于3个
*	   wdt_clk(约70us)。
*	************************************************************************************
*  								       客户服务
*	感谢您使用我们的单片机，若发现错误或对函数的使用存在疑问。请添加上海芯圣电子官方QQ群
*	****************************技术支持群：201030494***********************************
*   ************************************************************************************
**/

#define ALLOCATE_EXTERN
#include "HC89S003F4.h"

void Delay_ms(unsigned int fui_i);	 //延时函数

unsigned char gui_i = 0;						 //LED翻转次数计数

/***************************************************************************************
  * @实现效果	WDT设置为看门狗模式，上电后LED1闪烁5次，如不喂狗，5.93s后芯片复位
***************************************************************************************/
void main()
{
/*************** *********************系统初始化****************************************/
	WDTCCR = 0x00;				 		         //关闭看门狗
		                                 //本例程为方便测试关闭看门狗，实际使用中，建议客户打开看门狗，详见WDT复位例程
	CLKSWR = 0x51;						         //选择内部高频RC为系统时钟，内部高频RC 2分频，Fosc=16MHz
	CLKDIV = 0x01;						         //Fosc 1分频得到Fcpu，Fcpu=16MHz 
/**********************************相关配置初始化**************************************/
	P0M0 = P0M0&0xF0|0x08;				     //P00设置为推挽输出
/***********************************WDT配置初始化**************************************/
	WDTC = 0x57;						           //允许WDT复位，允许掉电/空闲模式下运行，1024分频

	//WDT使用的是RC44K时钟，WDT_CLOCK_1024是1024分频，初值为0xFF
	//定时时间 	= 1024 * 0xFF / 44000
	//			    = 5.93s

	WDTCCR = 0xFF;						         //写入00时，将关闭WDT功能（但不关闭内部低频RC），
										                 //即相当于禁止WDT。写入非0数据时，将启动WDT。
	for(gui_i=10;gui_i>0;gui_i--)
	{
			P0_0 =~ P0_0;   			         //对P00取反	
			Delay_ms(250);
	}
	while(1)
	{
//			WDTC |= 0x10;              //清狗
	}
}

/**
  * @说明  	延时函数
  * @参数  	fui_i : 延时时间
  * @返回值 无
  * @注 	  Fcpu = 16MHz，fui_i = 1时，延时时间约为1Ms
  */
void Delay_ms(unsigned int fui_i)
{
	unsigned int fui_j;
	for(;fui_i > 0;fui_i --)
	for(fui_j = 1596;fui_j > 0;fui_j --);
}