/**
*   ************************************************************************************
*								上海芯圣电子股份有限公司
*								    www.holychip.cn
*	************************************************************************************
*	@Examle Version		V1.0.5.0
*	@Demo 	Version		V1.0.4.0
*	@Date				2019.12.27
*	************************************************************************************
*									 模块性能介绍
* 1、提供多种复位方式
* 2、所有复位方式都有特定标志位
*	************************************************************************************
*									 应用注意事项
*	1、掉电模式下自动关闭BOR消抖功能和外部RST消抖功能，退出掉电模式又自动打开
*	2、使用外部复位引脚时需要在代码选项中配置
*	************************************************************************************
*  								       客户服务
*	感谢您使用我们的单片机，若发现错误或对函数的使用存在疑问。请添加上海芯圣电子官方QQ群
*	****************************技术支持群：201030494***********************************
*   ************************************************************************************
**/

#define ALLOCATE_EXTERN
#include "HC89S003F4.h"

unsigned char guc_Count = 0;            //IO翻转计数
void Delay_ms(unsigned int fui_i);		  //延时函数

/***************************************************************************************
  * @实现效果	判断系统是POR复位还是外部RST复位，如果是POR复位LED1闪烁，如果是外部RXT
				      复位LED2闪烁
  * @注意事项	需要在代码选项中将P27口设置为复位引脚
***************************************************************************************/
void main()
{
	WDTCCR = 0x00;					           	  //关闭看门狗
	                                      //本例程为方便测试关闭看门狗，实际使用中，建议客户打开看门狗，详见WDT复位例程	
	CLKSWR = 0x51;						            //选择内部高频RC为系统时钟，内部高频RC 2分频，Fosc=16MHz
	CLKDIV = 0x01;						            //Fosc 1分频得到Fcpu，Fcpu=16MHz
/**********************************相关配置初始化**************************************/
	P0M0 = P0M0&0xF0|0x08;				        //P00设置为推挽输出
	P1M0 = P1M0&0xF0|0x08;				        //P10设置为推挽输出
/***********************************复位标志判断***************************************/
	if(RSTFR&0x80)						            //判断是否为POR复位
	{
		RSTFR = 0x00;					              //清除复位标志位
		for(guc_Count=0;guc_Count<10;guc_Count++)
		{
			P0_0 =~ P0_0;
			Delay_ms(250);
		}	
	}
	if(RSTFR&0x40)						            //判断是否为外部RST复位
	{
		RSTFR &=~ 0x40;					            //清除外部RST复位标志位
		for(guc_Count=0;guc_Count<10;guc_Count++)
		{
			P1_0 =~ P1_0;
			Delay_ms(250);
		}	
	}	
	while(1);
}

/**
  * @说明  	延时函数
  * @参数  	fui_i : 延时时间
  * @返回值 无
  * @注 	  Fcpu = 16MHz，fui_i = 1时，延时时间约为1Ms
  */
void Delay_ms(unsigned int fui_i)
{
	unsigned int fui_j;
	for(;fui_i > 0;fui_i --)
	for(fui_j = 1596;fui_j > 0;fui_j --);
}