/**
*   ************************************************************************************
*								上海芯圣电子股份有限公司
*								    www.holychip.cn
*	************************************************************************************
*	@Examle Version		V1.0.5.0
*	@Demo 	Version		V1.0.4.0
*	@Date				2019.12.27
*	************************************************************************************
*									 模块性能介绍
*	1、P0xDBCT [5:0]配置的消抖时间是一个范围，分频系数*Tosc*P0xDBCT[5:0]-Tosc<消抖时间<
*	   分频系数*Tosc*(P0xDBCT[5:0]+1)-Tosc。
*	2、MCU上电复位以及其它复位功能的复位，所有的IO相关寄存器都会恢复为默认值。
*	************************************************************************************
*									 应用注意事项
*	1、在使用仿真器时，与JTAG复用的IO口会有读取或写入数据异常，因此建议使用仿真器时不要
*	   操作这几个IO口。断开仿真器使用电源供电即可以正常操作。
*	2、分配到P0.0/P0.1/P0.2这三个管脚上的功能脚、外部中断输入、故障检测引脚都受消抖控制。
*	3、P27管脚出厂默认为RST管脚，可以通过Option配置为普通IO引脚。
*	************************************************************************************
*  								       客户服务
*	感谢您使用我们的单片机，若发现错误或对函数的使用存在疑问。请添加上海芯圣电子官方QQ群
*	****************************技术支持群：201030494***********************************
*   ************************************************************************************
**/

#define ALLOCATE_EXTERN
#include "HC89S003F4.h"

/***************************************************************************************
  * @实现效果	设置各个IO口的工作状态
***************************************************************************************/
void main()
{
/************************************系统初始化****************************************/
	WDTCCR = 0x00;					    	//关闭看门狗
		                            //本例程为方便测试关闭看门狗，实际使用中，建议客户打开看门狗，详见WDT复位例程
	CLKSWR = 0x51;					    	//选择内部高频RC为系统时钟，内部高频RC 2分频，Fosc=16MHz
	CLKDIV = 0x01;						    //Fosc 1分频得到Fcpu，Fcpu=16MHz 
/***********************************设置IO口模式***************************************/
	P0M1 = P0M1&0xF0|0x00;				//P02设置为输入(非施密特)
	P0M0 = P0M0&0x0F|0x10;				//P01设置为带下拉输入(非施密特)
	P0M0 = P0M0&0xF0|0x02;				//P00设置为带上拉输入(非施密特)
	P1M0 = P1M0&0x0F|0x30;				//P11设置为带模拟输入
	P2M0 = P2M0&0xF0|0x04;				//P20设置为输入(施密特)
	P0M2 = P0M2&0x0F|0x50;				//P05设置为带下拉输入(施密特)
	P0M2 = P0M2&0xF0|0x06;				//P04设置为带上拉输入(施密特)
	P0M3 = P0M3&0x0F|0x80;				//P07设置为推挽输出
	P0M3 = P0M3&0xF0|0x09;				//P06设置为开漏输出
	P2M1 = P2M1&0xF0|0x0A;				//P22设置为带上拉开漏输出
	while(1);
}