/**
*   ************************************************************************************
*								上海芯圣电子股份有限公司
*								    www.holychip.cn
*	************************************************************************************
*	@Examle Version		V1.0.5.0
*	@Demo 	Version		V1.0.4.0
*	@Date				2019.12.27
*	************************************************************************************
*									 模块性能介绍
*	1、定时器3只有一个工作方式：16位自动重载计数器/定时器，可以设置预分频比，并可以工作
*	   在掉电模式
*	2、TH3和TL3读写操作遵循以下顺序：先高位后低位
*	************************************************************************************
*									 应用注意事项
*	1、T3外部时钟输入口必须设置为数字输入
*	2、T3时钟使用内部时钟时，T3无法工作在掉电模式下
*	3、必须在使能前给TH3，TL3赋值
*	4、当T3计数时钟源选择端口输入外部时钟，TR3和T3CLKS的配置需要同时进行，即使用一条指
*	   令完成配置
*	************************************************************************************
*  								       客户服务
*	感谢您使用我们的单片机，若发现错误或对函数的使用存在疑问。请添加上海芯圣电子官方QQ群
*	****************************技术支持群：201030494***********************************
*   ************************************************************************************
**/

#define ALLOCATE_EXTERN
#include "HC89S003F4.h"

/***************************************************************************************
  * @实现效果	T3使用外部32K晶振，定时1s唤醒，唤醒后LED1翻转
***************************************************************************************/
void main()
{
/************************************系统初始化****************************************/
	WDTCCR = 0x00;						//关闭看门狗
		                        //本例程为方便测试关闭看门狗，实际使用中，建议客户打开看门狗，详见WDT复位例程
	CLKSWR = 0x51;						//选择内部高频RC为系统时钟，内部高频RC 2分频，Fosc=16MHz
	CLKDIV = 0x01;						//Fosc 1分频得到Fcpu，Fcpu=16MHz 
/**********************************相关配置初始化**************************************/
	P0M0 = P0M0&0xF0|0x08;		//P00设置为推挽输出
/**********************************TIM3配置初始化**************************************/
	FREQ_CLK = 0x10;					//本例程涉及掉电模式，需指明当前系统时钟
  CLKCON |= 0x04;

	//Tim3计算时间  = (65536 - 0x8000) * (1 / 外部输入时钟)
	//				= 32768 / (32768 / 1)
	//				= 1s

	//定时1s
	//反推初值  = 65536 - (1 / (1 / 外部输入时钟))
	//			= 65536 - (1 / (1 / 32768))
	//          = 65536 - 32768
	//			= 0x8000

	TH3 = 0x80;
	TL3 = 0x00;	 						  //定时时间根据外部时钟计算
	T3CON = 0x46;						  //允许掉电模式下运行，时钟1分频
	IE1 |= 0x02;					  	//打开T3中断    
    
	EA = 1;							    	//打开总中断
	while(1)
	{
		 PCON |= 0x02;				  //进入掉电模式
	}
}

/***************************************************************************************
  * @说明  	T3中断服务函数
  *	@参数	  无
  * @返回值 无
  * @注		  无
***************************************************************************************/
void TIMER3_Rpt(void) interrupt T3_VECTOR
{
	 T3CON &=~ 0x80;					 //清除中断标志位
	 P0_0 =~ P0_0;						 //P00翻转	
}