/**
*   ************************************************************************************
*								上海芯圣电子股份有限公司
*								    www.holychip.cn
*	************************************************************************************
*	@Examle Version		V1.0.5.0
*	@Demo 	Version		V1.0.4.0
*	@Date				2019.12.27
*	************************************************************************************
*  								       客户服务
*	感谢您使用我们的单片机，若发现错误或对函数的使用存在疑问。请添加上海芯圣电子官方QQ群
*	****************************技术支持群：201030494***********************************
*   ************************************************************************************
**/


#define	ALLOCATE_EXTERN
#include "HC89S003F4.h"

void Delay_ms(unsigned int fui_i);		//延时函数
/***************************************************************************************
  * @实现效果	对P00口进行高、低电平转换，LED1不断翻转
***************************************************************************************/
void main()
{		
	WDTCCR = 0x00;						//关闭看门狗
	                          //本例程为方便测试关闭看门狗，实际使用中，建议客户打开看门狗，详见WDT复位
	CLKSWR = 0x51;						//选择内部高频RC为系统时钟，内部高频RC 2分频，Fosc=16MHz
	CLKDIV = 0x01;						//Fosc 1分频得到Fcpu，Fcpu=16MHz 
	
	P0M0 = P0M0&0xF0|0x08;		//P00设置为推挽输出
	while(1)
	{
		 P0_0= 0;
     Delay_ms(200);
		 P0_0= 1;
		 Delay_ms(200);
	}
}

void Delay_ms(unsigned int fui_i)
{
	unsigned int fui_j;
	for(;fui_i > 0;fui_i --)
	for(fui_j = 1596;fui_j > 0;fui_j --);
}